Repository: pjmd89/flutter_frontend_labs
Catalog: lib/l10n/app_*.arb
Languages: es

source: Language
es: Idioma

# languageEnglish
source: English
es: Inglés

# languageSpanish
source: Spanish
es: Español

# brightnessTheme
source: Theme
es: Tema

# brightnessLight
source: Light
es: Claro

# brightnessDark
source: Dark
es: Oscuro

source: Date
es: Fecha

source: Confirm
es: Confirmar

source: Something went wrong
es: Algo salió mal

source: Connection error
es: Error de conexión

source: Please try later
es: Por favor, inténtelo más tarde

# tryAgain
source: Int√©ntalo de nuevo
es: Inténtalo de nuevo

source: Invoice
es: Factura

source: Invoices
es: Facturas

source: Laboratory
es: Laboratorio

source: Select Exams
es: Seleccionar Exámenes

source: Selected Exams
es: Exámenes Seleccionados

source: No exams selected
es: No hay exámenes seleccionados

source: Search exams
es: Buscar exámenes

source: Select at least one exam
es: Seleccione al menos un examen

# referred
source: Referred by
es: Referido por

source: Cancel Payment
es: Cancelar Pago

# cancelPaymentQuestion
source: Cancel payment for this invoice?
es: ¿Cancelar el pago de esta factura?

source: Mark as Paid
es: Marcar como Pagado

# markAsPaidQuestion
source: Mark this invoice as paid?
es: ¿Marcar esta factura como pagada?

source: Update Payment Status
es: Actualizar Estado de Pago

source: Payment Status
es: Estado de Pago

source: Paid
es: Pagado

source: Pending
es: Pendiente

source: Canceled
es: Cancelado

source: Total Amount
es: Total

source: Order ID
es: ID de Orden

source: Invoice Type
es: Tipo de Factura

# invoiceTypeInvoice
source: Invoice
es: Factura

# invoiceTypeCreditNote
source: Credit Note
es: Nota de Crédito

source: Invoice marked as paid
es: Factura marcada como pagada

# paymentCanceled
source: Payment canceled successfully
es: Pago cancelado exitosamente

source: Bill To
es: Facturar a

# billToInformation
source: Payer Information
es: Información del Pagador

source: Create New Person
es: Crear Nueva Persona

source: Select Existing Person
es: Seleccionar Persona Existente

source: Person for Billing
es: Persona para Facturación

# noData
source: No data available
es: No hay datos disponibles

source: User
es: Usuario

source: Users
es: Usuarios

source: Company
es: Empresa

source: Companies
es: Empresas

source: Exam
es: Examen

source: Exams
es: Exámenes

source: Exam Template
es: Plantilla de Examen

source: Exam Templates
es: Plantillas de Examen

source: Evaluation Package
es: Paquete de Evaluación

source: Evaluation Packages
es: Paquetes de Evaluación

source: Approve
es: Aprobar

source: Approve Evaluation Package
es: Aprobar Paquete de Evaluación

# approveEvaluationPackageConfirmation
source: Are you sure you want to approve this evaluation package? This action will register your review as a bioanalyst.
es: ¿Está seguro de que desea aprobar este paquete de evaluación? Esta acción registrará su revisión como bioanalista.

source: Evaluation package approved successfully
es: Paquete de evaluación aprobado exitosamente

# viewOnlyMode
source: You can only view this evaluation package. Only owners and technicians can edit the results.
es: Solo puedes ver este paquete de evaluación. Solo los propietarios y técnicos pueden editar los resultados.

# bioanalystViewMode
source: As a bioanalyst, you can review the results and approve the evaluation package when it's complete.
es: Como bioanalista, puedes revisar los resultados y aprobar el paquete de evaluación cuando esté completo.

# markAsCompletedDescription
source: Mark that all exam results have been completed and are ready for bioanalyst review.
es: Marca que todos los resultados de los exámenes han sido completados y están listos para revisión del bioanalista.

# isApproved
source: Approved
es: Aprobado

source: Approved
es: Aprobado

source: Not Approved
es: No Aprobado

source: Reviewed by
es: Revisado por

# reviewedAt
source: Review date
es: Fecha de revisión

source: Bioanalyst Review
es: Revisión del Bioanalista

source: Status
es: Estado

# statusCompleted
source: Completed
es: Completado

# statusInProgress
source: In Progress
es: En Progreso

# statusPending
source: Pending
es: Pendiente

# statusUnknown
source: Unknown
es: Desconocido

source: General Information
es: Información General

source: Creation date
es: Fecha de creación

source: View PDF
es: Ver PDF

source: No exams registered
es: No hay exámenes registrados

source: Indicator Values
es: Valores de Indicadores

# noIndicatorValues
source: No indicator values registered
es: No hay valores de indicadores registrados

source: Cost
es: Costo

source: Exam without name
es: Examen sin nombre

source: Indicator
es: Indicador

source: Observations
es: Observaciones

source: PDF Filepath
es: Ruta de PDF

source: Completed At
es: Completado el

source: Template
es: Plantilla

source: Base Cost
es: Costo Base

source: Dashboard
es: Panel de Control

source: Welcome to Dashboard
es: Bienvenido al Panel de Control

# dashboardDescription
source: Manage your laboratory from here
es: Gestiona tu laboratorio desde aquí

source: Manage users
es: Gestionar usuarios

source: Manage companies
es: Gestionar empresas

source: Laboratories
es: Laboratorios

source: Manage laboratories
es: Gestionar laboratorios

source: Manage exam templates
es: Gestionar plantillas de examen

source: Reports
es: Reportes

source: View reports
es: Ver reportes

source: Tax ID
es: RIF

# companyLogoFileName
source: company_logo
es: logo_empresa

source: Upload
es: Subir

source: Uploading...
es: Subiendo...

source: Logo selected
es: Logo seleccionado

source: Current logo
es: Logo actual

source: Non-editable information
es: Información no editable

source: January
es: enero

source: February
es: febrero

source: March
es: marzo

source: April
es: abril

source: May
es: mayo

source: June
es: junio

source: July
es: julio

source: August
es: agosto

source: September
es: septiembre

source: October
es: octubre

source: November
es: noviembre

source: December
es: diciembre

source: Owner
es: Propietario

source: Optional
es: Opcional

source: Add
es: Agregar

source: Company Information
es: Información de la Empresa

source: Laboratory Information
es: Información del Laboratorio

source: Address
es: Dirección

source: Phone Number
es: Teléfono

source: Add phone number
es: Agregar teléfono

source: New {thing}
es: Nuevo {thing}

# newFemeThing
source: New {thing}
es: Nueva {thing}

source: Create {thing}
es: Crear {thing}

source: Update {thing}
es: Actualizar {thing}

source: Edit {thing}
es: Editar {thing}

source: Delete {thing}
es: Eliminar {thing}

# deleteQuestion
source: Are you sure you want to delete {thing}?
es: ¿Está seguro de eliminar {thing}?

source: {thing} created successfully
es: {thing} creado exitosamente

# femeThingCreatedSuccessfully
source: {thing} created successfully
es: {thing} creada exitosamente

source: {thing} updated successfully
es: {thing} actualizado exitosamente

# femeThingUpdatedSuccessfully
source: {thing} updated successfully
es: {thing} actualizada exitosamente

source: Error updating
es: Error al actualizar

source: Created
es: Creado

source: Updated
es: Actualizado

# noRegisteredMaleThings
source: No {thing} registered
es: No hay {thing} registrados

# noRegisteredFemaleThings
source: No {thing} registered
es: No hay {thing} registradas

# noRegisteredThings
source: No {thing} registered
es: No hay {thing} registrados

source: Name
es: Nombre

source: First Name
es: Nombre

source: Last Name
es: Apellido

source: Email
es: Correo electrónico

source: Description
es: Descripción

source: Value Type
es: Tipo de Valor

# valueTypeNumeric
source: Numeric
es: Numérico

# valueTypeText
source: Text
es: Texto

# valueTypeBoolean
source: Boolean
es: Booleano

source: Unit
es: Unidad

source: Normal Range
es: Rango Normal

source: Indicators
es: Indicadores

source: Add indicator
es: Agregar indicador

source: Loading...
es: Cargando...

source: Error loading data
es: Error al cargar los datos

source: No data available
es: No hay datos disponibles

source: Search
es: Buscar

source: Filter
es: Filtrar

source: Edit
es: Editar

source: View
es: Ver

source: Delete
es: Eliminar

source: Save
es: Guardar

source: Cancel
es: Cancelar

source: Role
es: Rol

# roleAdmin
source: Administrator
es: Administrador

# roleUser
source: User
es: Usuario

# roleOwner
source: Owner
es: Propietario

# roleTechnician
source: Technician
es: Técnico

# roleBilling
source: Billing
es: Facturación

# roleBioanalyst
source: Bioanalyst
es: Bioanalista

# roleUnknown
source: No role
es: Sin rol

# isAdmin
source: Is administrator
es: Es administrador

source: Cut-off date
es: Fecha de corte

source: Fee
es: Tarifa

source: View laboratories
es: Ver laboratorios

source: View billing
es: Ver facturación

# error001
source: User not logged in
es: Usuario no ha iniciado sesión

# error002
source: Empty or invalid input ID
es: ID de entrada vacío o inválido

# error003
source: User not found
es: Usuario no encontrado

# error004
source: Laboratory not found
es: Laboratorio no encontrado

# error005
source: Error when trying to create laboratory
es: Error al intentar crear el laboratorio

# error006
source: Error when trying to update laboratory
es: Error al intentar actualizar el laboratorio

# error007
source: Error when trying to delete laboratory
es: Error al intentar eliminar el laboratorio

# error008
source: Laboratory is required
es: El laboratorio es requerido

# error009
source: An account already exists with the email provided
es: Ya existe una cuenta con el correo electrónico proporcionado

# error010
source: A company already exists with the tax ID provided
es: Ya existe una empresa con el RUC/NIT proporcionado

# error011
source: Error when trying to create user
es: Error al intentar crear el usuario

# error012
source: Error when trying to update user
es: Error al intentar actualizar el usuario

# error013
source: Error when trying to delete user
es: Error al intentar eliminar el usuario

# error014
source: Missing owner or company info
es: Falta información del propietario o de la empresa

# error015
source: Company not found
es: Empresa no encontrada

# error016
source: Error when trying to create company
es: Error al intentar crear la empresa

# error017
source: Error when trying to update company
es: Error al intentar actualizar la empresa

# error018
source: Error when trying to delete company
es: Error al intentar eliminar la empresa

# error019
source: Once you log in for the first time, you cannot update your email
es: Una vez que inicias sesión por primera vez, no puedes actualizar tu correo electrónico

# error020
source: The employee is not part of the laboratory
es: El empleado no forma parte del laboratorio

# error021
source: User already logged in
es: El usuario ya ha iniciado sesión

# error022
source: Invalid OIDC state code
es: Código de estado OIDC inválido

# error023
source: Error when trying to create OIDC state code
es: Error al intentar crear el código de estado OIDC

# error024
source: Error when trying to log in with OIDC
es: Error al intentar iniciar sesión con OIDC

# error025
source: Access denied
es: Acceso denegado

# error026
source: Invalid phone number, must be in E.164 format
es: Número de teléfono inválido, debe estar en formato E.164

# error027
source: Invalid email format
es: Formato de correo electrónico inválido

# error028
source: Invalid date time format, must be unix timestamp
es: Formato de fecha y hora inválido, debe ser timestamp unix

# error029
source: Session not found
es: Sesión no encontrada

# error030
source: Error when trying to create exam template
es: Error al intentar crear la plantilla de examen

# error031
source: Error when trying to update exam template
es: Error al intentar actualizar la plantilla de examen

# error032
source: Error when trying to delete exam template
es: Error al intentar eliminar la plantilla de examen

# error033
source: Exam template not found
es: Plantilla de examen no encontrada

# error034
source: The exam template is being used in one or more laboratory exams
es: La plantilla de examen está siendo usada en uno o más exámenes de laboratorio

# error035
source: An exam template with the same name already exists
es: Ya existe una plantilla de examen con el mismo nombre

# error036
source: Company ID is required
es: El ID de la empresa es requerido

# error037
source: Address cannot be empty
es: La dirección no puede estar vacía

# error038
source: The employee is already part of the laboratory
es: El empleado ya forma parte del laboratorio

# error039
source: The laboratory has no employees
es: El laboratorio no tiene empleados

# error040
source: Exam not found
es: Examen no encontrado

# error041
source: Error when trying to create exam
es: Error al intentar crear el examen

# error042
source: Error when trying to update exam
es: Error al intentar actualizar el examen

# error043
source: Error when trying to delete exam
es: Error al intentar eliminar el examen

# error044
source: Exam base cost must be a positive value
es: El costo base del examen debe ser un valor positivo

# error045
source: The exam is being used in one or more evaluation packages and cannot be deleted
es: El examen está siendo usado en uno o más paquetes de evaluación y no puede ser eliminado

# error046
source: Missing human patient fields
es: Faltan campos del paciente humano

# error047
source: The date time provided cannot be greater than the current time
es: La fecha y hora proporcionada no puede ser mayor que la hora actual

# error048
source: Error when trying to create patient
es: Error al intentar crear el paciente

# error049
source: Error when trying to update patient
es: Error al intentar actualizar el paciente

# error050
source: Patient not found
es: Paciente no encontrado

# error051
source: An account already exists with the phone number provided
es: Ya existe una cuenta con el número de teléfono proporcionado

# error052
source: Error when trying to delete patient
es: Error al intentar eliminar el paciente

# error053
source: A person with the provided DNI already exists
es: Ya existe un paciente con el DNI proporcionado

# error054
source: Invoice not found
es: Error genérico 54

# error055
source: Error when trying to create invoice
es: Error genérico 55

# error056
source: Error when trying to update invoice
es: Error genérico 56

# error057
source: Cannot use exams with the same template
es: Error genérico 57

# error058
source: Error when trying to create evaluation package
es: Error genérico 58

# error059
source: Evaluation package not found
es: Error genérico 59

# error060
source: Error when trying to update evaluation package
es: Error genérico 60

# error061
source: Invoice payment has already been canceled
es: Error genérico 61

# error062
source: Indicator #%d for input exam #%d has out of range index (%d)
es: Error genérico 62

# error063
source: Invalid value for indicator #%d in input exam #%d
es: Error genérico 63

# error064
source: Indicator #%d is duplicated for input exam #%d
es: Error genérico 64

# error065
source: Input exam #%d is not part of the evaluation package
es: Error genérico 65

# error066
source: All the exams for this evaluation package have already been completed
es: Todos los exámenes de este paquete de evaluación ya han sido completados

# error067
source: The payment for this evaluation package has been canceled. Cannot manage exam values
es: Error genérico 67

# error068
source: Results of exam #%d are still missing
es: Error genérico 68

# error069
source: Input exam #%d contains more indicator values than the exam allows
es: Error genérico 69

# error070
source: The number of input exams exceeds the number of exams included in the evaluation package
es: Error genérico 70

source: Patient
es: Paciente

source: Patients
es: Pacientes

source: Gender
es: Género

# genderMale
source: Male
es: Masculino

# genderFemale
source: Female
es: Femenino

source: Species
es: Especie

# speciesHuman
source: Human
es: Humano

# speciesCanine
source: Canine
es: Canino

# speciesFeline
source: Feline
es: Felino

# speciesEquine
source: Equine
es: Equino

# speciesBovine
source: Bovine
es: Bovino

# speciesOther
source: Other
es: Otro

source: Birth Date
es: Fecha de Nacimiento

# dni
source: ID Number
es: Cédula

source: Phone
es: Teléfono

source: Search Patient
es: Buscar Paciente

# searchByDNI
source: Search by ID Number
es: Buscar por Cédula/DNI

source: Patient found
es: Paciente encontrado

source: Patient not found
es: Paciente no encontrado

# patientNotFoundCreateFirst
source: Patient not found. Please create it first in the Patients module.
es: Paciente no encontrado. Por favor, créelo primero en el módulo de Pacientes.

# patientRequired
source: You must select a patient to create the invoice
es: Debe seleccionar un paciente para crear la factura

source: Complete patient data
es: Complete los datos del paciente

source: Add Exam
es: Agregar Examen

# years
source: {count} years
es: {count} años

# dniRequiredOver17
source: ID required for patients over 17 years old
es: Cédula obligatoria para mayores de 17 años

source: Search exam...
es: Buscar examen...

# examsCount
source: Number of exams
es: Cantidad de exámenes

source: Logout
es: Cerrar sesión

# logoutConfirmation
source: Are you sure you want to logout?
es: ¿Está seguro que desea cerrar sesión?

source: Logging out...
es: Cerrando sesión...

source: Sex
es: Sexo

# sexFemale
source: Female
es: Femenino

# sexMale
source: Male
es: Masculino

source: Patient Type
es: Tipo de paciente

# patientTypeHuman
source: Human
es: Humano

source: Deleting...
es: Eliminando...

source: {thing} deleted successfully
es: {thing} eliminado exitosamente

# femeThingDeletedSuccessfully
source: {thing} deleted successfully
es: {thing} eliminada exitosamente

# errorDeleting
source: Error deleting {thing}
es: Error al eliminar {thing}

# actionIsIrreversible
source: This action is irreversible
es: Esta acción es irreversible

# cannotDeleteHasDependencies
source: Cannot delete because it has related records
es: No se puede eliminar porque tiene registros relacionados

# cannotDeleteInUse
source: Cannot delete because it is in use
es: No se puede eliminar porque está en uso

source: Record not found
es: El registro no fue encontrado

# permissionDenied
source: You do not have permission to perform this action
es: No tiene permisos para realizar esta acción

source: All results completed
es: Todos los resultados completados

# allResultsCompletedDescription
source: Check if all exam results have been completed and verified correctly
es: Marcar si todos los resultados del examen han sido completados y verificados correctamente

source: Add observation
es: Agregar observación

# noObservations
source: No observations recorded
es: No hay observaciones registradas

source: Observation
es: Observación

# examResultsNote
source: Note: Exam results are edited in their corresponding module
es: Nota: Los resultados de exámenes se editan en su módulo correspondiente

source: Exam results
es: Resultados de exámenes

# fieldRequired
source: This field is required
es: Este campo es requerido

source: Remove
es: Eliminar

source: Close
es: Cerrar

source: Invalid number
es: Número inválido

# mustBePositive
source: Must be a positive number
es: Debe ser un número positivo

source: Template description
es: Descripción de la plantilla

# atLeastOnePhoneRequired
source: You must add at least one contact phone
es: Debe agregar al menos un teléfono de contacto

source: Select Laboratory
es: Seleccionar Laboratorio
